Repository: pounard/yamm
Catalog: translations/*.po
Languages: fr

source: Server advertised that download method is private, canceled image fetching
fr: Le serveur a averti que la méthode de téléchargement des fichier est privée, la récupération des image est annulée

source: Yamm IMG module seems deactivated on server, trying anyway
fr: Le module Yamm IMG semble être désactivée sur le serveur, on essaye quand même

source: Could not save image '@source'
fr: Impossible de sauvegarder '@source'

source: Could not get image '@source' from server
fr: Impossible de récupérer '@source' depuis le serveur

source: Aptempt to copy files referenced by <img> tag from server when copying nodes
fr: Tente de copier les fichiers référencés par les balises <img> lors de la copie des contenus provenant du serveur

source: DataSync is disabled, its options are not available
fr: DataSync est désactivé, ses options ne sont pas disponibles

source: Cleaning tasks (advanced users)
fr: Tâches de nettoyage (utilisateurs avancés)

source: Rebuild option will try to fix DataSync module configuration to make it work without any further configuration. Note that this might not work on all environments. Clean state option will clean up the current state, and delete all current running DataSync Yamm jobs
fr: L'option de reconstruction va tenter de configurer le module DataSync sans nécessiter d'autre intervention. notez que ceci peut échouer sur certains environnements. L'option de nettoyage va effaçer toutes les tâches DataSync relatifs au module Yamm en cours.

source: Rebuild DataSync configuration
fr: Recontruire la configuration de DataSync

source: Clean state
fr: Nettoyer l'état

source: Yammm global options
fr: Options générales de Yamm

source: Debug mode
fr: Mode debug

source: Check this and you will get A LOT of debug messages in watchdog entries
fr: Si vous cochez cette option, vous obtiendrez BEAUCOUP de messages de debug dans les entrées du journal

source: Clean operation ran successfully
fr: L'opération de nettoyage s'est terminée avec succès

source: DataSync configuration rebuilt
fr: La configuration de DataSync à été reconstruite

source: Content type
fr: Type de contenu

source: Node
fr: Noeud

source: Taxonomy term
fr: Terme de taxonomie

source: Taxonomy vocabulary
fr: Vocabulaire de taxonomie

source: User
fr: Utilisateur

source: Theme
fr: Thème

source: Simple hello
fr: Hello simple

source: Full content synchronisation job
fr: Synchronisation complète du contenu

source: server waiting pull
fr: le serveur en attend la récupération

source: client canceled
fr: le client a annulé

source: finished
fr: terminé

source: server is down
fr: le serveur est innacessible

source: client says already running
fr: le client dit: déjà en train de fonctionner

source: client says unknown method
fr: le client dit: méthode inconnue

source: unknown
fr: inconnnu

source: Unable to reach @url (xmlrpc error @errno : "@errmsg") while calling @method with @args
fr: Impossible d'atteindre @url (erreur xmlrpc @errno: "@errmsg") lors de l'appel de @method avec les arguments @args

source: Configure and manage synchronisation server
fr: Configurer et gérer le serveur de synchronisation

source: Common options
fr: Option communes

source: Edit Yamm API common options
fr: Éditer les options communes de Yamm API

source: Yamm help
fr: Aide de Yamm

source: Yamm documentation uses <i>Advanced help</i> module. You should consider installing it if you want to read the full documentation.
fr: La documentation de Yamm utilise le module <i>Advanced Help</i>. Vous devez l'installer si vous voulez consulter cette dernière.

source: Yamm API module uses the PECL::Package::UUID extention if present to generate correct V4 UUID, you should consider install it before server.
fr: Le module Yamm API utilise l'extension PECL::Package::UUID si elle est installée pour générer des UUID V4 valides, vous deviez l'installer avant d'utiliser le serveur.

source: PECL::Package::UUID extention installed. Yamm will generate correct V4 UUID.
fr: L'extension PECL::Package::UUID est installée. Yamm génèrera des UUID V4 valides.

source: Yet Another Migration Module common API
fr: API commune de Yet Another Migration Module

source: Content type revisions
fr: Révisions des types de contenu

source: If you check this option, modified content types will be copied with a new name, time based. All node associated to old content type will be moved to the content type revision. Note that it will break your views which are content_type based, and could break some other modules behavior.
fr: Si vous cochez cette option, les types de contenus modifiés seront copiés sur le client avec un nouveau nom basée sur le temps. Tous les noeuds associés avec l'ancien type de contenu verront leur type changer. Notez que ceci va empêcher vos vues basées sur le type de contenu de fonctionner normalement, et pourrait aussi altérer le comportement d'autres modules.

source: Ignore content type
fr: Ignorer le type de contenu

source: Try to enable module, ignore in case of fail
fr: Essayer d'activer le module, l'ignorer en cas d'echec

source: If module exists update content type, else try to enable module
fr: Si le module existe, mettre à jour le type de contenu, sinon essayer d'activer le module

source: Whatever happens, save the content type
fr: Dans tous les cas, sauvegarder le nouveau type de contenu

source: Module content types behavior
fr: Comportement des modules définissant un type de contenu

source: Behavior to adopt when updating or inserting a module defined content type.
fr: Comportement à adopter lors de la mise à jour ou de l'insertion d'un type de contenu défini par un module.

source: Error during content import @msg
fr: Erreurs durant l'import de contenu @msg

source: Merge duplicates
fr: Fusionner les doublons

source: This options will merge client side local terms with incoming server ones if they share the same exact name. Note that terms linked to a UUID will not be merged. There is caveat with this method, to be sure we can handle multiple merge, we use the newly created identifier as reference, which could break existing contrib using term identifiers behavior (i.e. views based on tid).
fr: Cette option permet de fusionner les termes de taxonomie sur le client avec ceux provenant du serveur lorsqu'ils partage exactement le même nom. Les termes provenant de la synchronisation liés à un UUID ne seront pas fusionnés. Il y a un avertissement à prendre en compte, pour être sûr de pouvoir gérer la fusion d'un nombre indéterminé de termes ensemble, nous utilisons l'identifiant de celui provenant du serveur nouvellement créé comme référence, ce qui pourrait altérer le fonctionnement de certains modules utilisant l'identifiant de termes de taxonomies (i.e. les vues basées sur le tid).

source: Ignore new user definition (leave original as-is)
fr: Ignorer la définition du nouvel utilisateur (laisser celui sur le client en l'état)

source: Update all information
fr: Mettre à jour toutes les informations

source: Update all information except password
fr: Mettre à jour toutes les informations excepté le mot de passe

source: Update password only
fr: Mettre à jour le mot de passe uniquement

source: Duplicates handling
fr: Gestion des doublons

source: Define what behavior the the entity should adopt when username conflicts with an already existing one.
fr: Définit le comportement que les entities doivent adopter lorsqu'un nom d'utilisateur entre en conflit avec un déjà existant sur le client.

source: Admin override
fr: Surcharge de l'administrateur

source: Define what behavior the the entity should for site administrator.
fr: Définit le comportement à adopter pour le compte administrateur du site

source: Create new vocabulary
fr: Créer un nouveau vocabulaire

source: Update existing
fr: Mettre à jour l'existant

source: Define what behavior the the entity should adopt when vocabulary name conflicts with an existing one. Beware, if more than one duplicate is found, the algorithm won't merge but will create a new one instead.
fr: Définit le comportement que les entities doivent adopter lorsque le nom d'un vocabulaire entre en conflit avec un existant sur le client. Attention, si plus d'un doublon est trouvé, l'algorithme ne fusionnera aucun d'entre eux et en crééra un nouveau.

source: Server
fr: Serveur

source: URL must be the master website access URL. This is allow client to respond with XML/RPC calls to master Drupal instance.
fr: L'URL doit être celle du site internet du serveur. Celle ci permet au client de répondre à l'aide appels XML/RPC à l'instance de Drupal du serveur.

source: Transaction life time
fr: Durée de vie des transactions

source: None
fr: Aucune

source: 1 hour
fr: 1 heure

source: 6 hours
fr: 6 heures

source: 12 hours
fr: 12 heures

source: 1 day
fr: 1 jour

source: At each cron run, transaction older than this will be set as 'timeouted' and corresponding DataSync jobs will be set as failed.
fr: Lors de chaque lancement du cron, les transactions étant plus vieilles que ce paramètre seront mise en état 'timeouted' et les tâches DataSync correponsdantes seront marquées comme échouées.

source: You must configure server
fr: Vous devez configurer le serveur

source: Authentication test
fr: Test d'authentification

source: Push command from server
fr: Envoyer une commande du serveur

source: Yamm full data synchronisation
fr: Synchronisation complète du contenu Yamm

source: Will fully synchronize this client from Yamm server site
fr: Ceci synchronisera complètement le client depuis le site serveur Yamm

source: Authentification from XMLRPC call (user @user)
fr: Authentification depuis un appel XMLRPC (utilisateur @user)

source: Authentification from XMLRPC failed (user @user), error: @error
fr: Authentification depuis un appel XMLRPC échouée (utilisateur @user), erreur: @error

source: Edit master detail from which this client should respond
fr: Modifier les détails du serveur auquel doit répondre ce client

source: Yamm client
fr: Client Yamm

source: Yet Another Migration Module client side code
fr: Client Yet Another Migration Module

source: New transaction created for '@name', waiting for client to finish.
fr: Nouvelle transaction créé pour '@name', en attente que le client termine.

source: Client '@name' cancelled transaction
fr: Le client '@name' a annulé la transaction

source: Unknown status returned by client '@name'
fr: Le client '@name' a retourné un statut inconnu

source: Yamm push order to all activated clients
fr: Ordre de synchronisation à tous les clients activés

source: Yamm scheduler
fr: Ordonanceur Yamm

source: Yamm server scheduler based on DataSync job scheduling
fr: Ordonanceur Yamm basé sur une tâche DataSync ordonancée

source: Operations
fr: Opérations

source: Set selected as default
fr: Marquer la sélection par défaut

source: Add new item
fr: Ajouter un nouvel élément

source: Delete selected
fr: Éffacer la sélection

source: Update
fr: Mettre à jour

source: Default
fr: Défaut

source: Profile
fr: Profil

source: Name
fr: Nom

source: Edit
fr: Modifier

source: Are you sure you want to delete these profiles?
fr: Êtes-vous sûr de vouloir effacer ces profils?

source: They will be definitely removed. You won't be able to restore them.
fr: Ils seront définitivement effacés. Vous ne pourrez pas les restaurer.

source: Selected profiles deleted
fr: Les profils sélectionnés ont été effacés

source: Default profile updated.
fr: Le profile par défaut à été mis à jour

source: Not implemented yet
fr: Pas encore implémenté

source: Profile name
fr: Nom du profile

source: Internal name
fr: Nom interne

source: Must contains only alphanumeric caracters or _ and -
fr: Ne doit contenir que des caractères alpha-numériques ou _ et -

source: Views that export content
fr: Vues exportant du contenu

source: Type one view internal name per line
fr: Saisissez un nom de vue par ligne

source: Save
fr: Sauvegarder

source: You must set a name
fr: Vous devez saisir un nom

source: Views @views does not exist or are invalid
fr: Les vues @views n'existent pas où sont invalides

source: Profile @profile updated
fr: Profil @profile mis à jour

source: Profile @profile created
fr: Profil @profile créé

source: Submit
fr: Soumettre

source: Are you sure you want to delete these clients?
fr: Êtes-vous sûr de vouloir effacer ces clients?

source: Are you sure you want to suspend these clients?
fr: Êtes-vous sûr de vouloir suspendre ces clients?

source: These clients won't be synchronized anymore. You will be able to activate them back whenever you want.
fr: Ces clients ne seront plus synchronisés. Vous pourrez les réactiver quand vous le désirerez.

source: Are you sure you want to activate these clients?
fr: Êtes-vous sûr de vouloir activer ces clients?

source: These clients will be synchronized. You will be able to suspend them whenever you want.
fr: Ces clients seront synchronisés de nouveau. Vous pourrez les suspendre quand vous le désirerez.

source: Remove selected
fr: Effacer la sélection

source: Suspend selected
fr: Suspendre la sélection

source: Activate selected
fr: Activer la sélection

source: Username
fr: Nom d'utilisateur

source: Status
fr: Statut

source: Only letters, numbers and _ or - are allowed.
fr: Ne doit contenir que des caractères alpha-numériques ou _ et -

source: Client base url
fr: URL du client

source: Maintenance username for remote client. It must have the "launch sync jobs" permission.
fr: Nom de l'utilisateur de maintenance pour le client distant. Il doit avoir la permission "launch sync jobs".

source: Password
fr: Mot de passe

source: You have to type here the remote user password. Leave empty if you do not want to modify it.
fr: Vous devez saisir ici le mot de passe de l'utilisateur distant. Laissez ce champ vide si vous ne souhaitez pas le modifier.

source: Invalid name
fr: Nom invalide

source: Client does not exists
fr: Le client n'existe pas

source: Client name already taken
fr: Le nom est déjà pris

source: You must set a password
fr: Vous devez saisir un mot de passe

source: You must set credentials
fr: Vous devez saisir un couple nom d'utilisateur et mot de passe

source: Server is up
fr: Le serveur est fonctionnel

source: Unable to reach client
fr: Impossible de joindre le client

source: Server seems to be down
fr: Le serveur semble innaccessible

source: @name overview
fr: Vue d'ensemble de @name

source: Push method
fr: Commande à envoyer

source: Push
fr: Envoyer

source: New transaction created, waiting for client to finish.
fr: Nouvelle transaction créée, en attente que le client termine.

source: Client canceled transaction
fr: Le client a annulé la transaction

source: Unknown status returned by client (@id: @status)
fr: Le client a retourné un statut inconnu (@id: @status)

source: Client not responding
fr: Le client ne répond pas

source: Unknown method, push not send
fr: Commande inconnu, non envoyée

source: View @view exports @count objects
fr: La vue @view exporte @count objets

source: Properties
fr: Propriétés

source: When an incoming pull order arrives, and transaction is accepted by server
fr: Quand une commande entrante arrive et que la transaction est acceptée par le serveur

source: When an incoming pull order arrives, and transaction is erroneous
fr: Quand une commande entrante arrive et que la transaction est erronée

source: Unknown transaction incomming !tid
fr: Transaction entrante inconnue !tid

source: Unknown client for transaction !tid
fr: Client inconnu pour la transaction !tid

source: Client @name is suspended and transaction !tid is not in manual mode, aborting
fr: Le client @name est suspendu et la transaction !tid n'a pas été demandée manuellement, abandon

source: Transaction !tid sent signal
fr: La transaction !tid a envoyé un signal

source: Transaction unknown error for !tid
fr: Erreur inconnue lors de la transaction !tid

source: Clients list
fr: Liste des clients

source: Manage, add, delete, change status of clients
fr: Gérer, ajouter, effacer, changer le statut des clients

source: Client overview
fr: Vue d'ensemble du client

source: Add client
fr: Ajouter un client

source: Edit client
fr: Modifier un client

source: Profiles overview
fr: Vue d'ensemble des profils

source: Manage, add, delete profiles
fr: Gérer, ajouter, effacer les profils

source: Create profile
fr: Créer un profil

source: Edit profile
fr: Modifier le profil

source: Entities settings
fr: Paramètre des entities

source: Check client up
fr: Vérifier le client

source: Back to previous page
fr: Retour à la page précédente

source: No clients available.
fr: Aucun client disponible

source: Overview
fr: Vue d'ensemble

source: No Profile available.
fr: Aucun profil disponible

source: Activated
fr: Actif

source: Suspended
fr: Suspendu

source: Unknown
fr: Inconnu

source: Yamm server
fr: Serveur Yamm

source: Yet Another Migration Module server and UI
fr: Serveur et interface utilisateur de Yet Another Migration Module
